{"weightsManifest": [{"weights": [{"shape": [3, 3, 3, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 32], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_2/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 32], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_3/bias", "dtype": "float32"}, {"shape": [30752, 256], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [256, 128], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_2/bias", "dtype": "float32"}, {"shape": [128, 2], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_3/bias", "dtype": "float32"}], "paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"]}], "format": "layers-model", "generatedBy": "keras v2.2.4", "modelTopology": {"backend": "tensorflow", "keras_version": "2.2.4", "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"activation": "linear", "use_bias": true, "bias_regularizer": null, "filters": 32, "name": "conv2d_1", "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "batch_input_shape": [null, 250, 250, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 256, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"units": 128, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"units": 2, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Sequential"}, "training_config": {"loss_weights": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "lr": 0.009999999776482582, "momentum": 0.0, "nesterov": false}, "class_name": "SGD"}}}, "convertedBy": "TensorFlow.js Converter v1.3.2"}